SoapRequestSamples/PowerSearchRequestSample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<m:PowerSearchRequest xmlns:m="urn:PI/DevCentral/SoapService">
			<PowerSearchRequest xsi:type="m:PowerRequest">
				<power xsi:type="xsd:string">pubdate:2002 and author:Knuth</power>
				<mode xsi:type="xsd:string">books</mode>
				<tag xsi:type="xsd:string">webservices-20</tag>
				<type xsi:type="xsd:string">lite</type>
				<devtag xsi:type="xsd:string">your-dev-tag</devtag>
			</PowerSearchRequest>
		</m:PowerSearchRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
